FromRoom Property
The "From Room" set for the door or window.
Overload List
Name | Description
FromRoom
The "From Room" set for the door or window in the last phase of the project.
FromRoomPhase
See Also
FamilyInstance Class
FamilyInstance Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →